Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: You can also refer to capture groups relatively, by using a negative number, so that C<\g-1> and C<\g{-1}> both refer to the immediately preceding capture group, and C<\g-2> and C<\g{-2}> both refer to the group before it.
es_es: También puede referirse a los grupos de captura, de forma relativa, usando un número negativo, por lo que C<\g-1> y C<\g{-1}> se refieren al grupo de captura inmediatamente anterior, y C<\g-2> y C<\g{-2}> se refieren al grupo anterior a éste.

source: C<IO::Zlib> is an C<IO::>-style interface to C<Compress::Zlib>.
es_es: C<IO::Zlib> es un interfaz con estilo C<IO::> a C<Compress::Zlib>.

source: If the database does not exist, it is created with protection specified by MASK (as modified by the C<umask>).
es_es: Si la base de datos no existe, se crea con la protección especificada por MÁSCARA (y modificada por C<umask>).

source: =item a, d, l and u X</a> X</d> X</l> X</u>
es_es: =item a, d, l y u X</a> X</d> X</l> X</u>

source: can be rewritten as the much more efficient
es_es: puede ser reescrito de forma más eficiente

source: This might just confuse non-robust tools which parse the output of modules such as Devel::Peek.
es_es: Esto solo puede confundir a herramientas poco robustas que analicen la salida de los módulos, tales como Desarrollo::Peek.

source: The master web site for CPAN is http://www.cpan.org/ and there is the CPAN Multiplexer at http://www.cpan.org/CPAN.html which will choose a mirror near you via DNS.
es_es: El sitio web principal de CPAN está en http://www.cpan.org/ , y hay un multiplexor de CPAN en http://www.cpan.org/CPAN.html que elegirá un servidor reflejado mediante DNS.

source: Here's a clearer picture of why that pattern matches, contrary to popular expectations:
es_es: He aquí una idea más clara de por qué coincide con el patrón, al contrario de lo esperado:

source: m{ (?: NON_ZERO_LENGTH )* (?: ZERO_LENGTH )?
es_es: m{ (?: NO_CERO_LONGITUD )* (?: CERO_LONGITUD )?

source: Win32 portability fixes
es_es: Arreglos en la portabilidad de Win32

source: Since voting among different estimators may occur, the result is not predictable.
es_es: Debido a que la promoción puede ocurrir desde distintos estimadores, el resultado no es predecible.

source: =head2 Miscellaneous Enhancements
es_es: =head2 Mejoras varias

source: %O a synonym for %lo
es_es: %O un sinónimo para %lo

source: Thank you to the following for contributing to this release:
es_es: Gracias a las siguientes personas por contribuir a esta versión:

source: Localising C<$^D> no longer generates a diagnostic message about valid -D flags.
es_es: Localización de C<$^D> ya no genera un mensaje de diagnóstico sobre banderas válidas -D.

source: These special variables, like the C<%+> hash and the numbered match variables (C<$1>, C<$2>, C<$3>, etc.) are dynamically scoped until the end of the enclosing block or until the next successful match, whichever comes first.
es_es: Estas variables especiales, como el hash C<%+> y las variables de coincidencia numeradas (C<$1>, C<$2>, C<$3>, etc.) están dinámicamente contextualizadas hasta el final del bloque actual o hasta la siguiente coincidencia exitosa; lo que ocurra primero.

source: For integer conversions (C<d u o x X b i D U O>), numbers are usually assumed to be whatever the default integer size is on your platform (usually 32 or 64 bits), but you can override this to use instead one of the standard C types, as supported by the compiler used to build Perl:
es_es: Para las conversiones de entero (C<d u o x X b i D U O>), se asume que los números son, por lo general, de un tamaño, por defecto, de un entero de su plataforma (normalmente 32 or 64 bits), pero esto se puede reemplazar usando en su lugar uno de los tipos estándares de C, soportados por el compilador usado para construir Perl:

source: @array = delete @hash{qw(foo bar baz)}; # @array is (undef,undef,33)
es_es: @array = delete @hash{qw(foo bar baz)}; # @array es (undef,undef,33)

source: To check for that, use eval:
es_es: Para comprobar esto, use eval:

source: This way distributivity of smart match across arrays is not broken, as well as the other behaviours with complex types (coderefs, hashes, regexes).
es_es: De esta manera no se rompe la distribución del efecto de la coincidencia inteligente a través de arrays, así como otros comportamientos con los tipos complejos (referencias a código, hashes, expresiones regulares).

source: An effect similar to C<< (?>pattern) >> may be achieved by writing C<(?=(pattern))\g{-1}>.
es_es: Un efecto similar a C<< (?>patrón) >> se puede conseguir escribiendo C<(?=(patrón))\g{-1}>.

source: This happens anywhere the arrow operator is used, including even here:
es_es: Esto sucede en cualquier parte en que se use el operador flecha, incluso aquí:

source: Using C<readline> (or the operator form, C<< <EXPR> >>) as the conditional of a C<for> loop is shorthand for the following.
es_es: Usando C<readline> (o el operador C<< <EXPR> >>) como condición de un bucle C<for>, es una forma abreviada de escribir lo siguiente.

source: =head2 How does Perl compare with other languages like Java, Python, REXX, Scheme, or Tcl?
es_es: =head2 ¿Cómo es Perl en comparación con otros lenguajes como Java, Python, REXX, Scheme o Tcl?

source: =head2 Bitwise String Operators X<operator, bitwise, string>
es_es: =head2 Operadores de bit en cadenas X<operator, bitwise, string> X<operador, binario, cadena>

source: @foo = map { s/this/that/r } @bar # /r is very useful in maps
es_es: @foo = map { s/este/aquel/r } @bar # /r es muy útil con map

source: (.*?)(\d+) <I have > <2>
es_es: (.*?)(\d+) <Tengo > <2>

source: C<--nofilter> option to override the filtering has been added
es_es: Se añadió la opción C<--nofilter> para eliminar el filtrado

source: On most systems supporting fork(), great care has gone into making it extremely efficient (for example, using copy-on-write technology on data pages), making it the dominant paradigm for multitasking over the last few decades.
es_es: En la mayoría de los sistemas que soportan fork(), se ha tenido gran cuidado en hacerlo extremadamente eficiente (por ejemplo, usando la tecnología copy-on-write en páginas de datos), haciendo de él el paradigma dominante de la multitarea en las últimas décadas.

source: print v9786; # prints SMILEY, "\x{263a}"
es_es: print v9786; # imprime SONRISA, "\x{263a}"

source: C<CPAN/path/...> is a naming convention for files available on CPAN sites.
es_es: Se usa C<CPAN/ruta/...> como convención de nomenclatura para los archivos disponibles en los sitios de CPAN.

source: If not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA or visit their web page on the internet at http://www.gnu.org/copyleft/gpl.html.
es_es: Si no es así, escriba a la Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA, o visite su página web en Internet en http://www.gnu.org/copyleft/gpl.html .

source: substr($name, 7) = 'gap'; # raises an exception
es_es: substr($nombre, 7) = 'gap'; # lanza una excepción

source: As an example, C<find2perl . -user root -perm 4000 -print> produces the following callback subroutine for C<File::Find>:
es_es: Por ejemplo, C<find2perl . -user root -perm 4000 -print> genera la siguiente subrutina de devolución de llamada para C<File::Find>:

source: If a value is duplicated in the original hash, only one of those can be represented as a key in the inverted hash.
es_es: Si un valor está duplicado en el hash original, sólo uno de ellos puede ser representado como clave en el hash invertido.

source: C<unpack> does the reverse of C<pack>: it takes a string and expands it out into a list of values.
es_es: C<unpack> hace lo contrario de C<pack>: toma una cadena y se expande hacia fuera en una lista de valores.

source: These are not the very basics, though.
es_es: Aunque estos conceptos no son tan básicos...

source: Subroutines can also return values:
es_es: Las subrutinas también pueden devolver valores:

source: Hence Tom's quip that "Nothing but perl can parse Perl."
es_es: Ésta es la razón por la que Tom dice que "sólo perl puede analizar Perl".

source: perlartistic - the Perl Artistic License
es_es: perlartistic - la Licencia Artística

source: This packing may be opened with C<unpack("l!
es_es: Este empaquetado se puede abrir con C<unpack("l!

source: So if you have programmed in another language you will see familiar pieces in Perl.
es_es: Así que si ha programado en otro lenguaje verá partes en Perl que le serán familiares.

source: Similarly the NULL needs to be taken into account when you are considering the length of existing keys/values.
es_es: También hay que tener en cuenta el carácter NULL al determinar la longitud de claves y valores existentes.

source: -d File is a directory.
es_es: -d Archivo es un directorio.

source: It describes in detail how to cope with most idiosyncrasies that the C<Configure> script can't work around for any given system or architecture.
es_es: En este documento se describe en detalle cómo tener en cuenta la mayor parte de las idiosincrasias que el script C<Configure> no puede prever para una arquitectura o un sistema específicos.

source: * C<sub> was a keyword in Perl 4, but in Perl 5 it is an operator, which can be used in expressions.
es_es: * C<sub> era una palabra clave en Perl 4, pero en Perl 5 es un operador, por lo cual puede ser usado con paréntesis.

source: and when you execute Configure, do it as below, except for adding PATH=uts:$PATH as a prefix.
es_es: y cuando ejecute Configure, hágalo de la siguiente manera, con la adición de PATH=uts:$PATH como prefijo.

source: Because the slash that terminated C<m//> was followed by a C<SPACE>, the example above is not C<m//x>, but rather C<m//> with no C</x> modifier.
es_es: Debido a que la barra que terminó C<m//> fue seguida por un C<SPACE>, el ejemplo anterior no es C<m//x>, sino más bien C<m//>, sin el modificador C</x>.

source: Typically you will want to C<use I<Module::Name>>, which will then give you access to exported functions or an OO interface to the module.
es_es: Normalmente agregará a su programa la línea C<use I<Nombre::Módulo>>, que le proporcionará acceso a las funciones exportadas o a una interfaz orientada a objetos del módulo.

source: Strawberry Perl: Windows, Perl 5.8.8 and 5.10.0
es_es: Strawberry Perl: Windows, Perl 5.8.8 y 5.10.0

# That's all! ";
source: That's all!\n";
es_es: ¡Eso es todo!\n";

source: =head1 Future Directions
es_es: =head1 Direcciones futuras

source: Really means this:
es_es: En realidad significa lo siguiente:

source: You can also extend an array by assigning to an element that is off the end of the array.
es_es: También se puede extender un array haciendo una asignación a un elemento que esté más allá del final del array.

source: =head1 Platform Specific Notes
es_es: =head1 Notas específicas por cada plataforma

source: C<keys @array> in an lvalue context is a syntax error.
es_es: C<keys @array> en un contexto a la izquierda es un error de sintaxis.

source: That's very useful if you use things like C<substr>, or C<length>.
es_es: Esto resulta muy útil al utilizar funciones como C<substr> o C<length>.

source: In particular, the core development team (known as the Perl Porters) are a rag-tag band of highly altruistic individuals committed to producing better software for free than you could hope to purchase for money.
es_es: En concreto, el núcleo del equipo de desarrollo (denominado Perl Porters) está integrado por un grupo variopinto de personas de gran altruismo, dedicadas a producir gratuitamente software de mejor calidad que el que se podría obtener pagando.

source: q A signed quad (64-bit) value.
es_es: q Un valor cuádruplo con signo (64 bit).

source: Empty leading fields are produced when there are positive-width matches at the beginning of the string; a zero-width match at the beginning of the string does not produce an empty field.
es_es: Campos vacíos antecedentes son producidos cuando hay coincidencias de ancho positivas al principio de la cadena; una coincidencia de ancho cero al principio de la cadena no produce un campo vacío.

source: $string =~ /foo${re}bar/; # can be interpolated in other patterns
es_es: $cadena =~ /foo${re}bar/; # puede ser interpolado en otros patrones

source: while (($key, $value) = each %hash) { print $key, "\n"; delete $hash{$key}; # This is safe
es_es: while (($clave, $valor) = each %hash) { print $clave, "\n"; delete $hash{$clave}; # Esto es seguro

source: lowercase line-noise lowercase lowercase line-noise lowercase
es_es: minúsculas línea-ruido minúsculas minúsculas línea-ruido minúsculas

source: perl581delta - what is new for perl v5.8.1
es_es: perl581delta - qué hay de nuevo en perl v5.8.1

source: Using C<my> in combination with a C<use strict;> at the top of your Perl scripts means that the interpreter will pick up certain common programming errors.
es_es: Si escribe C<use strict;> al principio de los scripts de Perl y usa C<my>, el intérprete detectará determinados errores frecuentes de programación.

source: Many (but not all) of these leaks have now been eliminated or reduced.
es_es: Muchos (pero no todas) de estas fugas han sido eliminadas o reducidas.

source: See L<perlhist> for a history of Perl revisions.
es_es: En L<perlhist> encontrará el historial de revisiones de Perl.

source: Any single character matches itself, unless it is a I<metacharacter> with a special meaning described here or above.
es_es: Cualquier carácter individual coincide consigo mismo, a menos que sea un I<metacarácter> con un significado especial descrito aquí o anteriormente.

source: } elsif ( other condition ) {
es_es: } elsif ( otra condición ) {

source: sub convert {
es_es: sub convertir {

source: =item Parentheses for capturing
es_es: =item Paréntesis de captura

source: Double quotes or single quotes may be used around literal strings:
es_es: Las cadenas literales se pueden escribir entre comillas dobles o simples:

source: Notice that the outer bracket type has changed, and so our access syntax has also changed.
es_es: Observe que el paréntesis más exterior ha cambiado, por lo que nuestra sintaxis de acceso ha cambiado también.

source: This allows the pattern to match literally (except for C<$> and C<@>).
es_es: Esto permite que el patrón coincida literalmente (a excepción de C<$> y C<@>).

source: You must specify the block of code for C<sub>.
es_es: Debe especificar el bloque de código para C<sub>.

source: If we add a C<(*PRUNE)> before the count like the following
es_es: Si añadimos un C<(*PRUNE)> antes de la cuenta, como lo siguiente

source: This document is intended to give you a quick overview of the Perl programming language, along with pointers to further documentation.
es_es: Este documento proporciona una introducción rápida al lenguaje de programación Perl e incluye referencias a documentación adicional.

source: It's here so that modules, programs, etc., that want to declare this as their distribution license can link to it.
es_es: Es aquí, si desea declarar esto como su licencia de distribución, donde los módulos, programas, etc, pueden enlazarse con ella.

source: C<while> repeats the statement I<while> the condition is true.
es_es: C<while> repite la instrucción I<mientras> la condición sea cierta.

source: perlwin32 Perl notes for Windows
es_es: perlwin32 Notas para Windows

source: Behaves like wait(2) on your system: it waits for a child process to terminate and returns the pid of the deceased process, or C<-1> if there are no child processes.
es_es: Se comporta como wait(2) de su sistema: espera a que un proceso hijo termine y devuelve el PID del proceso que ha fallecido, o C<-1> si no hay procesos hijos.

source: The inheritance hierarchy of C<B::> modules has changed; C<B::NV> now inherits from C<B::SV> (it used to inherit from C<B::IV>).
es_es: La jerarquía de la herencia de los módulos C<B::> ha sido cambiada; C<B::NV> ahora hereda desde C<B::SV> (se usaba para heredar desde C<B::IV>).

source: That's because strings that aren't numbers count as 0, just as they do in B<awk>:
es_es: Esto es porque las cadenas que no son números cuentan como 0, igual a como se comportan en B<awk>:

source: Every C<when> block is implicitly ended with a C<break>.
es_es: Cada bloque C<when> se termina, implícitamente, con un C<break>.

source: Shuts down a socket connection in the manner indicated by HOW, which has the same interpretation as in the syscall of the same name.
es_es: Cierra una conexión de socket en la manera indicada por el CÓMO, que tiene la misma interpretación que en la llamada del sistema del mismo nombre.

source: Causes the script to sleep for (integer) EXPR seconds, or forever if no argument is given.
es_es: Hace que el programa duerman EXPR segundos (entero), o para siempre si se da ningún argumento.

source: In 1.5.5 the threads tests stress_cv, stress_re, and stress_string are failing unless the environment variable PERLIO is set to "perlio" (which makes also the io/tell failure go away).
es_es: En 1.5.5 las pruebas de threads stress_cv, stress_re y stress_string siguen fallando a menos que la variable de entorno PerlIO se ajuste a "perlio" (que hace también desaparecer el fallo de io/tell).

source: Good error messages should go to C<STDERR>, include which program caused the problem, what the failed system call and arguments were, and (VERY IMPORTANT) should contain the standard system error message for what went wrong.
es_es: Los buenos mensajes de error deben ir al C<STDERR>, incluyendo qué programa causó el problema, qué función del sistema y qué argumentos fueron, y (MUY IMPORTANTE) debe contener el mensaje de error estándar del sistema por el cual falló.

source: See L</wantarray> for more on how the evaluation context can be determined.
es_es: Ver L</wantarray> para saber cómo determinar el contexto de la evaluación.

source: The last four modifiers listed above, added in Perl 5.14, control the character set semantics.
es_es: Los últimos cuatro modificadores enumerados anteriormente, agregados en Perl 5.14, controlan las semánticas del juego de caracteres.

source: printf "format l is %d, l!
es_es: printf "formato l es %d, l!

source: printf '<%10.5s>', "truncated"; # prints "< trunc>"
es_es: printf '<%10.5s>', "truncado"; # imprime "< trunc>"

source: It's the same, however, in that it does reparse the file every time you call it, so you probably don't want to do this inside a loop.
es_es: Es lo mismo, sin embargo, en que vuelve a interpretar el archivo cada vez que lo llama, así que, probablemente, no querrá hacer esto dentro de un bucle.

source: To use FILEHANDLE without a LIST to print the contents of C<$_> to it, you must use a real filehandle like C<FH>, not an indirect one like C<$fh>.
es_es: Para utilizar IDENTIFICADOR_ARCHIVO sin LISTA para imprimir el contenido de C<$_>, debe usar un identificador de archivo real, como C<FH>, no uno indirecto como C<$fh>.

source: To learn how to use a particular module, use C<perldoc I<Module::Name>>.
es_es: Para aprender a usar un módulo específico, ejecute C<perldoc I<Nombre::Módulo>>.

source: open(MEMORY, ">", \$var)
es_es: open(MEMORIA, ">", \$var)

source: Sets the current process group for the specified PID, C<0> for the current process.
es_es: Establece el grupo de procesos en curso para el PID especificado, C<0> para el proceso actual.

source: Beware that some command shells may place restrictions on the length of the command line.
es_es: Tenga en cuenta que algunos shell de comandos puede imponer restricciones a la longitud de la línea de comandos.

source: Also, memory management and allocation has been improved in a couple of points.
es_es: Además, la gestión de memoria y la asignación se ha mejorado en un par de puntos.

source: =item chown LIST X<chown> X<owner> X<user> X<group>
es_es: =item chown LISTA X<chown> X<owner> X<user> X<group> X<propietario> X<usuario> X<grupo>

source: Waits for a particular child process to terminate and returns the pid of the deceased process, or C<-1> if there is no such child process.
es_es: Espera que termine un proceso hijo en particular y devuelve el PID del proceso que ha fallecido, o C<-1> si no existe tal proceso hijo.

source: # Should be
es_es: # Debería ser

source: to get a hexadecimal digit, or
es_es: para obtener un dígito hexadecimal o

source: The new copy is always a plain string, even if the input string is an object or a tied variable.
es_es: La nueva copia siempre será una cadena normal, incluso si la entrada es un objeto o una variable enlazada.

source: $binary =~ s/\x00\x0F/\xFF\xF0/; # for the brave :)
es_es: $binario =~ s/\x00\x0F/\xFF\xF0/; # para valientes :)

source: On unpacking, bits are converted to a string of C<0>s and C<1>s.
es_es: Al desempaquetar, los bits son convertidos a una cadena de C<0> y C<1>.

source: Paul Szabo has analysed and patched C<suidperl> to remove existing known insecurities.
es_es: Paul Szabo ha analizado y parcheado C<suidperl> para eliminar los inseguridades conocidas en este momento.

source: \b [DMS]r ) # but isn't a common abbreviation
es_es: \b [DMS]r ) # pero no es una abreviatura conocida

source: =item sysopen FILEHANDLE,FILENAME,MODE,PERMS
es_es: =item sysopen IDENTIFICADOR_ARCHIVO,ARCHIVO,MODO,PERMISOS

source: If an existing module B<almost> does what you want, consider writing a patch, writing a subclass, or otherwise extending the existing module rather than rewriting it.
es_es: Si un ya existente módulo B<casi> hace lo que quiere, considere escribir un parche, escribir una subclase o, de otra manera, extienda el módulo actual en lugar de reescribirlo.

source: Invoking the regex engine in these blocks would make perl unstable.
es_es: Invocar el motor de expresiones regulares en estos bloques haría a perl inestable.

source: So don't do that.
es_es: Así que no lo haga.

source: Support returning the I<k>th root directly
es_es: Asistencia en la devolución directa de la I<k>-ésima raíz

source: Note that if there were a C<continue> block on the above, it would get executed even on discarded lines.
es_es: Note que si hubiera un bloque C<continue> a continuación del anterior, se ejecutaría incluso en las líneas descartadas.

source: Perl has three main variable types: scalars, arrays, and hashes.
es_es: En Perl hay tres tipos de variables principales: escalares, arrays y hashes.

source: A sound principle is to use only ranges that begin from and end at either alphabets of equal case (a-e, A-E), or digits (0-4).
es_es: Un buen principio es el de usar rangos que sólo comiencen y terminen, en cualquier alfabeto, con un mismo tamaño de caja (a-e, A-E), o dígitos (0-4).

source: The Perl columns of Randal L. Schwartz are available on the web at http://www.stonehenge.com/merlyn/WebTechniques/ , http://www.stonehenge.com/merlyn/UnixReview/ , and http://www.stonehenge.com/merlyn/LinuxMag/ .
es_es: Las columnas sobre Perl de Randal L. Schwartz están disponibles en Internet, en http://www.stonehenge.com/merlyn/WebTechniques/ , http://www.stonehenge.com/merlyn/UnixReview/ y http://www.stonehenge.com/merlyn/LinuxMag/ .

source: This function cannot be used on an entire array or hash to find out how many elements these have.
es_es: Esta función no puede utilizarse en un array o hash para averiguar cuántos elementos tienen.

source: Builtin types have all uppercase names.
es_es: Los tipos incluidos tienen todos sus nombres en mayúscula.
